<script>
import container from '../components/layout/container'
import Layout from "../components/layout/layout";
import Banner from '../components/blocks/banner/banner.vue'
import Breadcrumbs from '../components/blocks/breadcrumbs/breadcrumbs.vue'

export default {
    name: 'App',
    components: {
        Layout,
        Breadcrumbs,
        container,
        Banner
    },
    data() {
        return {
            fetchedText:
                '<h1 class="text-center">Агентство недвижимости Краснодара «АЯКС»</h1>' +
                    '<p>«АЯКС» — агентство недвижимости в Краснодаре.</p>' + 
                    '<p>Мы работаем с 15 июля 1998 года. С тех пор прошло больше 20 лет, за которые мы собрали более 30.000 объектов для бизнеса и жизни.</p>' +
                    '<p>Для чего мы работаем? Чтобы вы смогли быстро и безопасно найти любое жильё, в том числе и от 120 надёжных застройщиков Кубани, офис для новой команды, земельный участок, склад или готовый бизнес.</p>' +
                    '<br><p>Какие ещё услуги мы предоставляем:</p>' +
                    '<ul>'+
                        '<li>Точно подбираем квартиры и дома — учтем запросы, поможем с оформлением рассрочки;</li>'+
                        '<li>Помогаем покупать, продавать, арендовывать — создадим индивидуальный график показов и просмотров, чтобы быстро найти покупателя;</li>'+
                        '<li>Консультируем на всех этапах сделки — проанализируем рынок, подготовим эффективные рекомендации, поможем выгодно продать и купить;</li>' +
                        '<li>Оцениваем имущество, бизнес, автомобиль, ущерб при ДТП — быстро оценим, определим корректную стоимость, решим споры с кадастровой ценой;</li>' +
                        '<li>Сопровождаем юридически — проконсультируем лично или удаленно, подготовим документы, обеспечим законность сделки, защитим ваши интересы в суде;</li>'+
                        '<li>Помогаем получить ипотеку — найдем выгодный банк, поможем получить низкий процент, комфортные условия платежей, добьемся положительного решения от банка;</li>'+
                        '<li>Организуем профессиональную фотосъемку — сделаем ваш объект привлекательным, ускорим его продажу;</li>'+
                        '<li>Продвигаем — разработаем премиальную рекламу на 48-ми площадках, чтобы быстро продать ваш объект;</li>'+
                    '</ul>'+
                    '<h2>Как мы работаем?</h2>'+
                    '<p>С каждым клиентом мы общаемся лично, учитываем потребности, возможности и даже характер человека, чтобы подобрать по-настоящему желанное место для жизни.</p>'+
                    '<p>Мы работаем лично в любом из 23 офисов Краснодара, а также предоставляем возможность удаленных операций:</p>'+
                    '<ul>'+
                        '<li>Дистанционно подать объявление о продаже;</li>'+
                        '<li>Быстро найти нужный объект по критериям;</li>'+
                        '<li>Подать онлайн-заявку на ипотеку и рассчитать размер платежа;</li>'+
                    '</ul>'+
                    '<p>Экономия вашего времени — наш приоритет. Поэтому мы автоматизировали внутренние процессы, чтобы решение жилищных вопросов прошло быстро.</p>'+
                    '<p>На сайте есть любая информация: от недвижимости и последних новостей до детальных цен на услуги, а также подбора личного эксперта.</p>'+
                    '<h2>Наши достижения</h2>'+
                    '<table class="about-table certificates">'+
                        '<tbody>'+
                            '<tr>'+
                                '<td align="center"><img width="268" alt="&quot;АЯКС-Риэлт&quot; — член некоммерческого партнерства" src="https://www.ayax.ru//upload/resize_cache/iblock/650/268_378_1/650b0afda0363384dc95c2c29c5ad189.jpg" height="378" title="Свидетельство от Кубанской Палаты Недвижимости"> Свидетельство от Кубанской Палаты Недвижимости</td>'+
                                '<td align="center"><img width="268" alt="Свидетельство РСПП" src="https://www.ayax.ru//upload/resize_cache/iblock/de2/268_378_1/de214aa203228d53e6f8185352398ca8.jpg" height="375" title="Свидетельство от Российского союза промышленников и предпринимателей"> Свидетельство от Российского союза промышленников и предпринимателей</td>'+
                                '<td align="center"><img width="268" alt="Свидетельство ЮГРО" src="https://www.ayax.ru//upload/resize_cache/iblock/077/268_378_1/077ed2edec2c60ea127e05101ed2e6dd.jpg" height="375" title="Свидетельство Южной Гильдии риэлторов и оценщиков"> Свидетельство Южной Гильдии Риэлторов и оценщиков</td>'+
                                '<td align="center"><img width="268" alt="Сертификат РГР" src="https://www.ayax.ru//upload/resize_cache/iblock/4ac/268_378_1/4ac6b52ba69b40dcaa3b58bedf11976c.jpg" height="378" title="Сертификат Российской Гильдии Риэлторов"> Сертификат Российской Гильдии Риэлторов</td>'+
                            '</tr>'+
                        '</tbody>'+
                    '</table>'+
                    '<br><p>Смотреть <a href="https://www.ayax.ru/sertifikaty-agentstva-nedvizhimosti-krasnodara/" target="_blank">все сертификаты и дипломы агентства</a>.</p>'+
                    '<hr><p>Сегодня мы делаем все: подбираем объекты, помогаем покупать, продавать и арендовать, строим жилье, оказываем услуги по <a title="Оценка имущества в Краснодаре" href="https://www.ayax.ru/otsenka-krasnodare/">оценке&nbsp;имущества</a>, обеспечиваем юридическое сопровождение, помогаем получать кредиты, и не только.</p>'+
                    '<br><h2>Руководители риэлторского агентства «АЯКС»</h2>'
        }
    },
    mounted(){
        this.$store.dispatch('employee/list');
    },
    computed : {
        directors(){
            return this.$store.getters['employee/directors'];
        }
    }
}
</script>

<template lang="pug">
Layout(classes="page_about")
    Breadcrumbs(title="О компании")
    Banner(src='images/about-bg.jpg' noBlur)
    container
        .text( v-html="fetchedText" )
        table(class="about-table" title="Информация о дирекции риэлторского агентства АЯКС-Риэлт" cellspacing="5" cellpadding="15")
        tbody
            tr(v-for="item in directors")
                td(valign="top" style="width: 230px; height:auto")
                    img(style="width: 230px; height:auto" :alt="item.full_name" :src="item.image" title="item.full_name" align="top")
                td(valign="top")
                    h3 {{item.full_name}},{{item.position.name}}
                    p(v-html="item.description") 
</template>
