<script>
import Layout from "../components/layout/layout";
import container from '../components/layout/container'
import Breadcrumbs from '../components/blocks/breadcrumbs/breadcrumbs.vue'

export default {
    name: 'App',
    components: {
        container,
        Layout,
        Breadcrumbs,
    },
    props: {
        title: String,

    },
    data() {
        return {

            fetchedText: '<p>Покупка или продажа недвижимого имущества – важный шаг. Далеко не каждый владеет необходимыми знаниями, чтобы проверить юридическую безопасность, осуществить сделку на выгодных условиях. Для этого нужен тот, кто уже зарекомендовал себя среди риэлторов, а главное провел тысячи сложнейших переговоров.</p><p>«АЯКС» предоставляет риэлторские услуги по поиску, купле-продаже <a href="#">домов</a> и <a href="#">квартир</a>, обмену, аренде жилой, коммерческой недвижимости, земельных участков. Наша база содержит более 20 000 предложений для Краснодарского края.</p><h2>Тестовый заголовок</h2><ul><li><em>поможем определиться с&nbsp;жильём, подберем как на первичном, так и на вторичном рынках;</em></li><li><em>полную проверку с юридической точки зрения;</em></li><li><em>сопровождение сделки купли-продажи;</em></li><li><em>помощь в получении ипотечных займов под низкий процент;</em></li><li><em>риэлторские услуги без комиссионных сборов (если купить новостройку).</em></li></ul><p><h2>Тестовый заголовок</h2></p><ol><li><ins>поможем определиться с&nbsp;жильём, подберем как на первичном, так и на вторичном рынках;</ins></li><li><strong>полную проверку с юридической точки зрения;</strong></li><li><del>сопровождение сделки купли-продажи;</del></li><li>помощь в получении ипотечных займов под низкий процент;</li><li>риэлторские услуги без комиссионных сборов (если купить новостройку).</li></ol>',

        }
    }
}
</script>

<template lang="pug">
    Layout
        container
            .text( v-html="fetchedText" )
</template>
