<script>
import Layout from "../components/layout/layout";
import Banner from '../components/blocks/banner/banner.vue'
import container from '../components/layout/container'
import Awards from '../components/blocks/awards/awards.vue'
import Consultation from '../components/blocks/consultation/consultation.vue'
import Breadcrumbs from '../components/blocks/breadcrumbs/breadcrumbs.vue'

export default {
    name: 'App',
    components: {
        Layout,
        Banner,
        container,
        Awards,
        Breadcrumbs,
        Consultation
    },
    props: {
        title: String,

    },
    data() {
        return {
            awardsItems: [
                {
                    name: 'Продажа жилой недвижимости (на вторичном рынке)	',
                    description: '3% от итоговой стоимости объекта, но не менее 100 тыс.руб.'
                },
                {
                    name: 'Покупка жилой недвижимости (на вторичном рынке)',
                    description: '3% от итоговой стоимости объекта, но не менее 100 тыс.руб.'
                },
                {
                    name: 'Покупка объектов от застройщика',
                    description: 'без комиссии'
                },
                {
                    name: 'Покупка коммерческой недвижимости',
                    description: '0% (бесплатно) при выборе эксклюзивного объекта, 3% от стоимости при выборе обычного объекта'
                },
                                {
                    name: 'Продажа коммерческой недвижимости',
                    description: '6% от стоимости объекта'
                },
                {
                    name: 'Аренда коммерческой недвижимости',
                    description: '0% для арендаторов, 100% месячной арендной платы для арендодателей'
                },
                {
                    name: 'Аренда жилой недвижимости',
                    description: 'от 70 до 100% от ежемесячной арендной платы'
                },
            ],
            fetchedText: '<div class="seo-text"><p>Покупка или продажа недвижимого имущества – важный шаг. Далеко не каждый владеет необходимыми знаниями, чтобы проверить юридическую безопасность, осуществить сделку на выгодных условиях. Для этого нужен тот, кто уже зарекомендовал себя среди риэлторов, а главное провел тысячи сложнейших переговоров.</p><p>«АЯКС» предоставляет риэлторские услуги по поиску, купле-продаже <a title="подобрать дом" href="/kupit-dom-v-krasnodare/">домов</a> и <a title="подобрать квартиру" href="/kvartiry/">квартир</a>, обмену, аренде жилой, коммерческой недвижимости, земельных участков. Наша база содержит более 20 000 предложений для Краснодарского края.</p><p>Агентство успешно работает уже более 22 лет. Мы участвовали в становлении рынка, знаем все детали оформления, сопровождения сделок. В практике компании есть самые сложные контракты с несколькими собственниками, отдельными долями жилья, тонкостями наследования.</p><p>«АЯКС» – локальный эксперт в области недвижимости. Наши риэлторы – специалисты с большим стажем работы, которые каждый день продолжают повышать свою квалификацию. Они владеют подробной аналитикой рынка в Краснодаре, готовы сориентировать в выборе, рассказать подробнее про каждый микрорайон, указать на перспективы.</p><h2>На нашем сайте можно:<br></h2><ul><li>Найти объект по фильтрам</li><li>Рассчитать размер платежа с помощью <a title="рассчитать платежи по ипотеке" href="/ipoteka-krasnodare/ipotechnyy-kalkulyator/">калькулятора ипотеки</a></li><li>Записаться на просмотр или оставить онлайн-заявку о предложении своей цены</li></ul><h2>Какие риэлторские услуги мы предлагаем:</h2><ul><li>Бесплатную консультацию</li><li><a title="Оценка недвижимости" href="/otsenka-krasnodare/">Оценку имущества</a></li><li>Помощь в оформлении ипотеки</li><li>Подготовку к продаже, фотосъемку</li><li>Торг, если речь идет о вторичном жилье</li><li>Поиск по критериям, по бюджету</li><li>Показ объектов</li><li>Юридическое сопровождение</li><li>Экспертную аналитику</li></ul><p>Нужны профессиональные риэлторские услуги – обращайтесь в АН «АЯКС». Наши технологии, методики и база объявлений позволят выгодно продать или купить <a title="Подбор недвижимости" href="/">недвижимость</a> согласно вашим условиям. Мы сориентируем вас на рынке, найдем жилье, обеспечим прозрачность сделки по комфортной цене – комиссия агентства составляет 3% от&nbsp;суммы покупки.</p></div>',
            bannerBtns: [
                {
                    path: '#',
                    title: 'Подать заявку',
                    class: 'js-scroll-form'
                }
            ]
        }
    },
    mounted(){
         this.$store.dispatch('consultypes/httpFetch');
    },
    computed : {
        tabsSlider(){
            return this.$store.getters["consultypes/slides"];
        },
        tabs(){
            return this.$store.getters["consultypes/records"];
        },
    }
}
</script>

<template lang="pug">
    Layout
        Breadcrumbs(title="Риэлторские услуги")
        Banner(src='images/realtor-service-bg.jpg' title='Риэлторские услуги' bannerBlur text="Обращайтесь только к профессионалам!" :bannerBtns="bannerBtns")
        container
            .text( v-html="fetchedText" )
        Awards( :awardsItems="awardsItems")
        Consultation(:tabsSlider="tabsSlider" :tabs="tabs" title="Бесплатная консультация экспертов" consultationText="Мы даем бесплатную консультацию по любому интересующему вас вопросу. Оставьте ваш контакт, мы назначим время звонка и поможем вам принять рациональное решение." consultationTitle="Получите бесплатную консультацию" scrollClass="scroll-block")
</template>