<script>
import Layout from "../components/layout/layout";
import container from '../components/layout/container.vue'
import Banner from '../components/blocks/banner/banner.vue'
import Stocks from '../components/blocks/stocks/stocks.vue'
import Breadcrumbs from '../components/blocks/breadcrumbs/breadcrumbs.vue'


export default {
  name: 'App',
  components: {
    Layout,
    container,
    Breadcrumbs,
    Banner,
    Stocks,
  },
  data() {
        return {
            stocksItems:[
                {
                   src: '/images/pages/internal-stocks/1.png',
                   text: 'Выгоднее, чем потребительский кредит!',
                   href: '/ipotaktsii-detail'
                },
                {
                    src: '/images/pages/internal-stocks/1.png',
                    text: 'Покупка жилья в ипотеку с 10% взносом!',
                    href: '/ipotaktsii-detail'
                },
                {
                    src: '/images/pages/internal-stocks/1.png',
                    text: 'Процентные ставки по ипотеке снижены!',
                    href: '/ipotaktsii-detail'
                }
            ],
            fetchedText: '<div class="seo-text"><p>Акции на недвижимость предлагают все представители стройиндустрии: из-за шквала предложений на рынке жилья покупателей привлекают не только характеристики объектов (тип застройки, отделки, параметры комнат), но и всевозможные бонусы и акции.</p><p><a title="Все квартиры от АЯКС" href="/kvartiry/">Квартиры</a> с мебелью, пониженные процентные ставки, подарки (например, автомобили или туристические поездки) - все это может получить как покупатель элитного коттеджа, так и студии в жилых комплексах эконом-класса.</p><p>Некоторые скидки агентство недвижимости "АЯКС" дополняет своими бонусами, ведь наше агентство тесно взаимодействует региональными девелоперами и банками. Такое партнерство обеспечивает нам возможность, к примеру, предоставлять покупателям очень комфортные ставки по <a title="Подбор ипотечных программ в Краснодаре" href="/ipoteka-krasnodare/">ипотечным займам</a>.</p><p>Риэлторские "фишки" тоже бывают весьма многообразны, как и акции застройщиков: мы ведь тоже стремимся обеспечить клиентов самыми лучшими и выгодными сервисами.</p><p>Дополнительная опция: специалисты агентства "АЯКС" регулярно мониторят предложения, чтобы выяснить, какие скидки на рынке недвижимости дают реальную экономию и не несут никаких рисков для покупателей. То есть вы в любой момент можете посоветоваться с риэлтором, если условия какой-либо акции не совсем понятны.</p><p>Добавим также, что наш прилавок акций и скидок постоянно расширяется и актуализируется: мы реагируем на малейшие рыночные изменения и выдаем бонусные продукты под любые потребности клиентов. Следите за обновлениями на сайте сервиса недвижимости "АЯКС" и в наших группах в соцсетях!</p></div>',


        }
    }
}
</script>

<template lang="pug">
Layout
    Breadcrumbs(title="Акции")
    Banner(title="Акции и скидки" src="/images/actions-bg.jpg")
    Stocks( :stocksItems="stocksItems")
    container
        .text( v-html="fetchedText" )
</template>
