<script>
import container from '../../layout/container'

export default {
    props: {

    },
    components: {
        container,
    }
}
</script>

<template lang="pug">
    container(extraClassRow="row-cols-1 gy-4")
        .col
            .product-strip
                .product-images
                    .product-strip--slider
                        .product-strip--views
                            span
                                img( src="images/eye.svg")
                            span 160
                        .product-strip--crown
                            span Эксклюзивно в Ayax
                        .product-strip--img
                            img(src="https://picsum.photos/300" alt="")
                .product-strip--descr
                    .product-strip--name
                        span 3-комнатная квартира, 72.1 м2
                    .product-strip--data
                        .product-strip--square
                            span 90 м²
                            span 4/24 этаж
                    .product-strip--place
                        span г. Краснодар, р-н Юбилейный, пр-кт Чекистов, 28
                    .product-strip--text
                        span Продам квартиру в предчистовой отделке.Свободной планировки.По документам жилое, возможна прописка. Любая форма оплаты! Вся необходимая инфраструктура в шаговой доступности! Цена подарок, успейте купить!!! Очень горячий ...
                .product-strip--info
                    .product-strip--price
                        span 5 650 000
                        span ₽
                    .product-strip--cost
                            span 78 363
                            span ₽/м2
                    .product-strip--mortgage
                        span Ипотека от
                        span 51 364
                        span ₽/мес
                    .product-strip--icon
                        .product-strip--compare
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 460 460">
                                    <path d="M279.27,392.188h-30.51V112.579h128.58l-54.464,86.423c-2.762,4.382-1.448,10.176,2.935,12.937 c1.554,0.98,3.282,1.445,4.992,1.445c3.115,0,6.161-1.551,7.944-4.378l47.235-74.954l47.233,74.954 c2.763,4.382,8.557,5.696,12.938,2.933c4.382-2.761,5.694-8.555,2.933-12.937l-54.462-86.423h0.688 c8.029,0,14.539-6.51,14.539-14.539c0-8.028-6.509-14.538-14.539-14.538H288.356c-6.04-8.786-14.954-15.438-25.39-18.596 C261.475,48.005,247.289,34.75,230,34.75c-17.29,0-31.475,13.255-32.967,30.156c-10.436,3.158-19.35,9.81-25.389,18.596H64.688 c-8.03,0-14.54,6.51-14.54,14.538c0,8.029,6.509,14.539,14.54,14.539h0.688l-54.464,86.423 c-2.762,4.382-1.448,10.176,2.934,12.937c1.554,0.98,3.283,1.445,4.992,1.445c3.114,0,6.162-1.551,7.945-4.378l47.235-74.954 l47.234,74.954c2.762,4.382,8.555,5.696,12.937,2.933c4.383-2.761,5.696-8.555,2.935-12.937l-54.463-86.423h128.58v279.607 h-30.509c-18.259,0-33.062,14.804-33.062,33.063h164.661C312.331,406.99,297.528,392.188,279.27,392.188z"></path>
                                    <path d="M143.035,223.359H5c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.018,74.017c40.813,0,74.018-33.204,74.018-74.017 C148.035,225.598,145.796,223.359,143.035,223.359z"></path>
                                    <path d="M455,223.359H316.965c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.019,74.017c40.813,0,74.017-33.204,74.017-74.017 C460,225.598,457.761,223.359,455,223.359z"></path>
                            </svg>
                        .product-strip--fav
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 20 18"><path d="M6.018 1C3.06 1 1 3.096 1 6.094c0 3.307 2.563 5.443 5.04 7.508 1.17.975 2.38 1.982 3.308 3.105a.826.826 0 0 0 .627.293.849.849 0 0 0 .673-.293c.931-1.123 2.14-2.13 3.313-3.105C16.437 11.537 19 9.402 19 6.094 19 3.096 16.94 1 13.982 1c-1.713 0-3.18 1.244-3.986 2.1C9.193 2.244 7.731 1 6.018 1z"></path></svg>

                    a(href="").product-strip--btn
                        span Связаться с риэлтором
        .col
            .product-strip
                .product-strip--slider
                    .product-strip--views
                        span
                            img( src="images/eye.svg")
                        span 160
                    .product-strip--crown
                        span Эксклюзивно в Ayax
                    .product-strip--img
                        img(src="https://picsum.photos/300" alt="")
                .product-strip--descr
                    .product-strip--name
                        span 3-комнатная квартира, 72.1 м2
                    .product-strip--data
                        .product-strip--square
                            span 90 м²
                            span 4/24 этаж
                    .product-strip--place
                        span г. Краснодар, р-н Юбилейный, пр-кт Чекистов, 28
                    .product-strip--text
                        span Продам квартиру в предчистовой отделке.Свободной планировки.По документам жилое, возможна прописка. Любая форма оплаты! Вся необходимая инфраструктура в шаговой доступности! Цена подарок, успейте купить!!! Очень горячий ...
                .product-strip--info
                    .product-strip--price
                        span 5 650 000
                        span ₽
                    .product-strip--cost
                            span 78 363
                            span ₽/м2
                    .product-strip--mortgage
                        span Ипотека от
                        span 51 364
                        span ₽/мес
                    .product-strip--icon
                        .product-strip--compare
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 460 460">
                                    <path d="M279.27,392.188h-30.51V112.579h128.58l-54.464,86.423c-2.762,4.382-1.448,10.176,2.935,12.937 c1.554,0.98,3.282,1.445,4.992,1.445c3.115,0,6.161-1.551,7.944-4.378l47.235-74.954l47.233,74.954 c2.763,4.382,8.557,5.696,12.938,2.933c4.382-2.761,5.694-8.555,2.933-12.937l-54.462-86.423h0.688 c8.029,0,14.539-6.51,14.539-14.539c0-8.028-6.509-14.538-14.539-14.538H288.356c-6.04-8.786-14.954-15.438-25.39-18.596 C261.475,48.005,247.289,34.75,230,34.75c-17.29,0-31.475,13.255-32.967,30.156c-10.436,3.158-19.35,9.81-25.389,18.596H64.688 c-8.03,0-14.54,6.51-14.54,14.538c0,8.029,6.509,14.539,14.54,14.539h0.688l-54.464,86.423 c-2.762,4.382-1.448,10.176,2.934,12.937c1.554,0.98,3.283,1.445,4.992,1.445c3.114,0,6.162-1.551,7.945-4.378l47.235-74.954 l47.234,74.954c2.762,4.382,8.555,5.696,12.937,2.933c4.383-2.761,5.696-8.555,2.935-12.937l-54.463-86.423h128.58v279.607 h-30.509c-18.259,0-33.062,14.804-33.062,33.063h164.661C312.331,406.99,297.528,392.188,279.27,392.188z"></path>
                                    <path d="M143.035,223.359H5c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.018,74.017c40.813,0,74.018-33.204,74.018-74.017 C148.035,225.598,145.796,223.359,143.035,223.359z"></path>
                                    <path d="M455,223.359H316.965c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.019,74.017c40.813,0,74.017-33.204,74.017-74.017 C460,225.598,457.761,223.359,455,223.359z"></path>
                            </svg>
                        .product-strip--fav
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 20 18"><path d="M6.018 1C3.06 1 1 3.096 1 6.094c0 3.307 2.563 5.443 5.04 7.508 1.17.975 2.38 1.982 3.308 3.105a.826.826 0 0 0 .627.293.849.849 0 0 0 .673-.293c.931-1.123 2.14-2.13 3.313-3.105C16.437 11.537 19 9.402 19 6.094 19 3.096 16.94 1 13.982 1c-1.713 0-3.18 1.244-3.986 2.1C9.193 2.244 7.731 1 6.018 1z"></path></svg>

                    a(href="").product-strip--btn
                        span Связаться с риэлтором
        .col
            .product-strip
                .product-strip--slider
                    .product-strip--views
                        span
                            img( src="images/eye.svg")
                        span 160
                    .product-strip--crown
                        span Эксклюзивно в Ayax
                    .product-strip--img
                        img(src="https://picsum.photos/300" alt="")
                .product-strip--descr
                    .product-strip--name
                        span 3-комнатная квартира, 72.1 м2
                    .product-strip--data
                        .product-strip--square
                            span 90 м²
                            span 4/24 этаж
                    .product-strip--place
                        span г. Краснодар, р-н Юбилейный, пр-кт Чекистов, 28
                    .product-strip--text
                        span Продам квартиру в предчистовой отделке.Свободной планировки.По документам жилое, возможна прописка. Любая форма оплаты! Вся необходимая инфраструктура в шаговой доступности! Цена подарок, успейте купить!!! Очень горячий ...
                .product-strip--info
                    .product-strip--price
                        span 5 650 000
                        span ₽
                    .product-strip--cost
                            span 78 363
                            span ₽/м2
                    .product-strip--mortgage
                        span Ипотека от
                        span 51 364
                        span ₽/мес
                    .product-strip--icon
                        .product-strip--compare
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 460 460">
                                    <path d="M279.27,392.188h-30.51V112.579h128.58l-54.464,86.423c-2.762,4.382-1.448,10.176,2.935,12.937 c1.554,0.98,3.282,1.445,4.992,1.445c3.115,0,6.161-1.551,7.944-4.378l47.235-74.954l47.233,74.954 c2.763,4.382,8.557,5.696,12.938,2.933c4.382-2.761,5.694-8.555,2.933-12.937l-54.462-86.423h0.688 c8.029,0,14.539-6.51,14.539-14.539c0-8.028-6.509-14.538-14.539-14.538H288.356c-6.04-8.786-14.954-15.438-25.39-18.596 C261.475,48.005,247.289,34.75,230,34.75c-17.29,0-31.475,13.255-32.967,30.156c-10.436,3.158-19.35,9.81-25.389,18.596H64.688 c-8.03,0-14.54,6.51-14.54,14.538c0,8.029,6.509,14.539,14.54,14.539h0.688l-54.464,86.423 c-2.762,4.382-1.448,10.176,2.934,12.937c1.554,0.98,3.283,1.445,4.992,1.445c3.114,0,6.162-1.551,7.945-4.378l47.235-74.954 l47.234,74.954c2.762,4.382,8.555,5.696,12.937,2.933c4.383-2.761,5.696-8.555,2.935-12.937l-54.463-86.423h128.58v279.607 h-30.509c-18.259,0-33.062,14.804-33.062,33.063h164.661C312.331,406.99,297.528,392.188,279.27,392.188z"></path>
                                    <path d="M143.035,223.359H5c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.018,74.017c40.813,0,74.018-33.204,74.018-74.017 C148.035,225.598,145.796,223.359,143.035,223.359z"></path>
                                    <path d="M455,223.359H316.965c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.019,74.017c40.813,0,74.017-33.204,74.017-74.017 C460,225.598,457.761,223.359,455,223.359z"></path>
                            </svg>
                        .product-strip--fav
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 20 18"><path d="M6.018 1C3.06 1 1 3.096 1 6.094c0 3.307 2.563 5.443 5.04 7.508 1.17.975 2.38 1.982 3.308 3.105a.826.826 0 0 0 .627.293.849.849 0 0 0 .673-.293c.931-1.123 2.14-2.13 3.313-3.105C16.437 11.537 19 9.402 19 6.094 19 3.096 16.94 1 13.982 1c-1.713 0-3.18 1.244-3.986 2.1C9.193 2.244 7.731 1 6.018 1z"></path></svg>

                    a(href="").product-strip--btn
                        span Связаться с риэлтором
        .col
            .product-strip
                .product-strip--slider
                    .product-strip--views
                        span
                            img( src="images/eye.svg")
                        span 160
                    .product-strip--crown
                        span Эксклюзивно в Ayax
                    .product-strip--img
                        img(src="https://picsum.photos/300" alt="")
                .product-strip--descr
                    .product-strip--name
                        span 3-комнатная квартира, 72.1 м2
                    .product-strip--data
                        .product-strip--square
                            span 90 м²
                            span 4/24 этаж
                    .product-strip--place
                        span г. Краснодар, р-н Юбилейный, пр-кт Чекистов, 28
                    .product-strip--text
                        span Продам квартиру в предчистовой отделке.Свободной планировки.По документам жилое, возможна прописка. Любая форма оплаты! Вся необходимая инфраструктура в шаговой доступности! Цена подарок, успейте купить!!! Очень горячий ...
                .product-strip--info
                    .product-strip--price
                        span 5 650 000
                        span ₽
                    .product-strip--cost
                            span 78 363
                            span ₽/м2
                    .product-strip--mortgage
                        span Ипотека от
                        span 51 364
                        span ₽/мес
                    .product-strip--icon
                        .product-strip--compare
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 460 460">
                                    <path d="M279.27,392.188h-30.51V112.579h128.58l-54.464,86.423c-2.762,4.382-1.448,10.176,2.935,12.937 c1.554,0.98,3.282,1.445,4.992,1.445c3.115,0,6.161-1.551,7.944-4.378l47.235-74.954l47.233,74.954 c2.763,4.382,8.557,5.696,12.938,2.933c4.382-2.761,5.694-8.555,2.933-12.937l-54.462-86.423h0.688 c8.029,0,14.539-6.51,14.539-14.539c0-8.028-6.509-14.538-14.539-14.538H288.356c-6.04-8.786-14.954-15.438-25.39-18.596 C261.475,48.005,247.289,34.75,230,34.75c-17.29,0-31.475,13.255-32.967,30.156c-10.436,3.158-19.35,9.81-25.389,18.596H64.688 c-8.03,0-14.54,6.51-14.54,14.538c0,8.029,6.509,14.539,14.54,14.539h0.688l-54.464,86.423 c-2.762,4.382-1.448,10.176,2.934,12.937c1.554,0.98,3.283,1.445,4.992,1.445c3.114,0,6.162-1.551,7.945-4.378l47.235-74.954 l47.234,74.954c2.762,4.382,8.555,5.696,12.937,2.933c4.383-2.761,5.696-8.555,2.935-12.937l-54.463-86.423h128.58v279.607 h-30.509c-18.259,0-33.062,14.804-33.062,33.063h164.661C312.331,406.99,297.528,392.188,279.27,392.188z"></path>
                                    <path d="M143.035,223.359H5c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.018,74.017c40.813,0,74.018-33.204,74.018-74.017 C148.035,225.598,145.796,223.359,143.035,223.359z"></path>
                                    <path d="M455,223.359H316.965c-2.761,0-5,2.238-5,5c0,40.813,33.204,74.017,74.019,74.017c40.813,0,74.017-33.204,74.017-74.017 C460,225.598,457.761,223.359,455,223.359z"></path>
                            </svg>
                        .product-strip--fav
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 20 18"><path d="M6.018 1C3.06 1 1 3.096 1 6.094c0 3.307 2.563 5.443 5.04 7.508 1.17.975 2.38 1.982 3.308 3.105a.826.826 0 0 0 .627.293.849.849 0 0 0 .673-.293c.931-1.123 2.14-2.13 3.313-3.105C16.437 11.537 19 9.402 19 6.094 19 3.096 16.94 1 13.982 1c-1.713 0-3.18 1.244-3.986 2.1C9.193 2.244 7.731 1 6.018 1z"></path></svg>

                    a(href="").product-strip--btn
                        span Связаться с риэлтором
        .col
            .product-strip.product-strip--banner
                .product-strip--img
                    img(src="/images/pages/kupit-zhilye/cottage-1.jpg" alt="")
                .product-strip--name
                    span Не нашли нужного варианта?
                .product-strip--text
                    span Подберем до 20 объектов по вашим параметрам
                a(href="").product-strip--btn
                    span Связаться с риэлтором
</template>
