<script>
import container from '../../layout/container.vue'
import { swiper, swiperSlide } from 'vue-awesome-swiper'
import 'swiper/swiper-bundle.css'  

export default {
    components: {
        container,
        swiper,
        swiperSlide
    },
    props: {
      title: String,
      serviceAgencyItems: Array,
      tabsService: Array,
    },
    data(){
        return{ 
            isMob: false,
            sliderOptions: {
                slidesPerView: 1.1, 
                spaceBetween: 10,
                pagination: {
                    el: '#paginationAgency',
                    type: 'bullets',
                    clickable: true
                },
            },
            tabActive: 0,
            tabsServiceMain: [
               {
                    serviceTab: [
                        {
                            id: 1,
                            name: 'Подбор недвижимости',
                            text: 'Подберем оптимальные варианты под ваши запросы. Поможем с ипотекой, рассрочкой, сертификатами и пр.',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><g fill-rule="nonzero"><path d="M15.382 27.015L.899 41.367a3.027 3.027 0 0 0 0 4.306l1.449 1.436a3.093 3.093 0 0 0 4.344 0l14.482-14.353-5.792-5.741zM.094 14H10v2H.094zM6.094 8H12v2H6.094zM9.094 20H13v2H9.094zM32 0c-8.836 0-16 7.164-16 16s7.164 16 16 16 16-7.164 16-16S40.836 0 32 0zm0 30c-7.731 0-14-6.269-14-14S24.269 2 32 2s14 6.269 14 14-6.269 14-14 14z"></path><path d="M32 3.5c-6.902 0-12.5 5.595-12.5 12.5S25.098 28.5 32 28.5c6.905 0 12.5-5.595 12.5-12.5S38.905 3.5 32 3.5zM31 8a7.006 7.006 0 0 0-7 6.999 1 1 0 1 1-2.001 0 9 9 0 0 1 9-9A1.001 1.001 0 0 1 31 8z"></path></g></svg>',

                        },
                        {
                            id: 2,
                            name: 'Оценка',
                            text: 'Быстро оценим любую недвижимость, бизнес и автотранспорт. Имеем аккредитацию от ведущих банков',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="27" viewBox="0 0 48 27"><g fill-rule="nonzero"><path d="M23.999 0c-3.78 0-7.328 1.046-10.461 2.546-.702.335-1.381.693-2.038 1.061-.697.396-1.367.8-2.009 1.229C6.94 6.507 4.805 8.344 3.209 9.885 1.163 11.855 0 13.5 0 13.5s1.163 1.646 3.209 3.615c1.597 1.543 3.731 3.379 6.282 5.051.643.43 1.312.834 2.009 1.229.656.371 1.336.726 2.038 1.06C16.671 25.954 20.219 27 23.999 27 37.548 27 48 13.5 48 13.5S37.548 0 23.999 0zm8.768 15.043A8.999 8.999 0 0 1 23.999 22 8.99 8.99 0 0 1 15 13.002c0-.557.05-1.096.146-1.623.76-4.191 4.437-7.38 8.852-7.38a8.997 8.997 0 0 1 7.465 3.971 8.99 8.99 0 0 1 .952 1.831 9.047 9.047 0 0 1 .352 5.242z"></path><path d="M30.547 10.156a7.893 7.893 0 0 0-.742-1.499 7.098 7.098 0 0 0-3.165-2.658c.086.429.137.863.137 1.302 0 .508-.062 1-.164 1.479-.65 2.899-3.154 5.064-6.146 5.064A6.084 6.084 0 0 1 17 12.745a7.314 7.314 0 0 0 1.236 4.11c.22.339.467.653.738.94C20.252 19.15 22.031 20 23.999 20c3.325 0 6.104-2.395 6.822-5.619A7.635 7.635 0 0 0 31 12.727c0-.897-.159-1.786-.453-2.571z"></path></g></svg>',

                        },
                        {
                            id: 3,
                            name: 'Аналитика рынка',
                            text: 'Предоставляем аналитику по районам, типам недвижимости и тенденциям рынка для выгодной покупки',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><g fill="none" fill-rule="evenodd"><path class="f1" fill-rule="nonzero" d="M3 0h2v48H3z"></path><path class="f1" fill-rule="nonzero" d="M0 43h48v2H0zM12 27h8v15h-8zM21 33h8v9h-8zM30 39h8v3h-8zM39 42V31h8v11"></path><path class="f2" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"d="M4 43s5-28 14-26c5.857 1.302 5.512 17.992 13 13 3-2 7-26 16-26"></path><path class="f1" fill-rule="nonzero" d="M4 3h29v2H4zM5 7h12v2H5zM5 11h21v2H5z"></path></g></svg>',

                        },
                        {
                            id: 4,
                            name: 'Юридические услуги',
                            text: 'Сопроводим сделку купли-продажи, проведем полную проверку продавца и объекта. Защитим ваши интересы в суде',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><path fill-rule="nonzero"d="M33.108 18.083a4.874 4.874 0 0 0 6.618.255l1.154-.99L30.653 7.119l-.99 1.157a4.875 4.875 0 0 0 .253 6.616l3.192 3.191zM48 11.702L36.3 0l-4.411 5.476 10.637 10.636L48 11.702zM6.006 44.281l.068-.025c9.704-5.742 21.068-7.438 21.068-7.438-1.849-6.663 5.358-15.086 5.358-15.086l-2.584-2.584-3.646-3.649s-8.425 7.212-15.083 5.361c0 0-1.701 11.366-7.44 21.069l-.021.074A1.996 1.996 0 0 0 2 41a2 2 0 1 0 2 2c0-.019-.005-.036-.005-.055l9.698-9.698a4 4 0 1 1 1.063 1.064l-9.694 9.695C5.041 44.006 5.021 44 5 44a2 2 0 1 0 2 2 1.99 1.99 0 0 0-.994-1.719zM8 48h40v-2H8v2z"></path></svg>',

                        },
                        {
                            id: 5,
                            name: 'Цепочка показов',
                            text: 'Разработаем индивидуальный график просмотра до пяти вариантов в день',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="46" height="48" viewBox="0 0 46 48"><g fill="none" fill-rule="evenodd"><path class="f1" fill-rule="nonzero" d="M10.094 17.483s3.771-.54 4.223.335c.452.874 3.615 4.373 6.438 5.574 2.824 1.204 4.743 1.531 8.133 3.719 3.389 2.187 6.773 4.508 8.412 1.335 1.654-3.203-5.18-6.968-6.425-8.17-1.241-1.203-3.682-4.428-1.084-6.177 2.597-1.75 6.551 1.967 7.906 3.28 1.355 1.313 1.052 3.583.939 5.77-.218 4.219 1.208 6.258 3.354 6.148 2.146-.108 3.389-12.137 3.049-14.542-.338-2.406-7.794-8.42-8.924-9.077-2.596-1.509-9.023-3.756-11.857-3.389-5.458.708-13.14-.29-14.163-.29M9.094 31h8v2h-8zM1.094 36h11v2h-11zM12.094 42h5v2h-5zM8.04.017L.094 0v21l7.946-1.017c.582 0 1.054-.456 1.054-1.018V1.033C9.094.471 8.622.017 8.04.017zM7.094 18h-2V2h2v16z"></path><path class="f2" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M38.094 26s2 3 0 6"></path><path class="f1" fill-rule="nonzero" d="M22.299 36.923l1.299-.489.674.993 1.982-.743.593 1.482 1.062-.399a6.762 6.762 0 0 1 3.82-6.895c-.921-.514-1.88-1.141-2.841-1.761-.316-.204-.608-.377-.901-.552l-.033.013c-.484.183-.852.58-.991 1.07l-.499 1.771-2.013.756.592 1.482-8.586 3.228-.363 1.63 1.572 1.399 1.101-.411.102-.587.741.249.503-.201-.256-1.094.901-.361.772 1.038.981-.453-.212-1.165zm16.733-3.612a5.498 5.498 0 0 0-2.688-1.725c-.852.59-1.924.488-3.119.015a5.35 5.35 0 0 0-1.824.944c-1.883 1.501-2.403 3.996-1.48 6.092l-.78.632.304.363-7.176 5.815.179 1.69 1.957.863.919-.747-.399-1.049 1.32.304.368-.298-.579-1.058.551-.448 1.316.461.739-.608-.408-1.072.958-.857 1.131.611 1.268-1.042.296.354 1.218-.987c1.735.604 3.728.358 5.24-.85 2.3-1.832 2.605-5.146.689-7.403zm-1.61 3.657a1.708 1.708 0 0 1-2.348-.233 1.586 1.586 0 0 1 .211-2.279 1.707 1.707 0 0 1 2.349.235c.59.694.495 1.713-.212 2.277z"></path></g></svg>',

                        },
                        {
                            id: 6,
                            name: 'Ипотека',
                            text: 'Подберем выгодные условия от банков-партнеров с высокой вероятностью одобрения',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><path fill-rule="nonzero" d="M30 3v7H6V3a6 6 0 0 0-6 6v33a6 6 0 0 0 6 6h24a6 6 0 0 0 6-6V9a6 6 0 0 0-6-6zM7 44H4v-3h3v3zm0-6H4v-3h3v3zm0-6H4v-3h3v3zm0-6H4v-3h3v3zm5 18H9v-3h3v3zm0-6H9v-3h3v3zm0-6H9v-3h3v3zm0-6H9v-3h3v3zm5 18h-3v-3h3v3zm0-6h-3v-3h3v3zm0-6h-3v-3h3v3zm0-6h-3v-3h3v3zm5 18h-3v-3h3v3zm0-6h-3v-3h3v3zm0-6h-3v-3h3v3zm0-6h-3v-3h3v3zm5 18h-3v-3h3v3zm0-6h-3v-3h3v3zm0-6h-3v-3h3v3zm0-6h-3v-3h3v3zm5 18h-3v-9h3v9zm0-12h-3v-3h3v3zm0-6h-3v-3h3v3zm0-7H4v-6h28v6zM29 0l-2 2-3-2-3 2-3-2-3 2-3-2-3 2-2-2v9h22V0zm16 21h-3v21h3c1.656 0 3-1.344 3-3V24c0-1.656-1.344-3-3-3zm-8 21h3V21h-3v21z"></path></svg>',

                        },
                    ],
               },
               {
                    serviceTab: [
                        {
                            id: 1,
                            name: 'Цепочка показов',
                            text: 'Обеспечим безопасный показ по удобному для вас графику до трех показов в день',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="43" viewBox="0 0 48 43"><g fill-rule="nonzero"><path d="M19 0v10h24V0H19zm6 8h-2V2h2v6zM24 11v10h24V11H24zm6 8h-2v-6h2v6zM20 22v10h24V22H20zm6 8h-2v-6h2v6zM22 33v10h24V33H22zm6 8h-2v-6h2v6z"></path><path d="M1.5 30c0-6.351 5.149-11.5 11.5-11.5 2.703 0 5.183.939 7.146 2.5h2.221a12.955 12.955 0 0 0-9.368-4C5.82 17 0 22.82 0 30s5.82 13 13 13c3.021 0 5.793-1.039 8-2.768v-1.98a11.455 11.455 0 0 1-8 3.248C6.649 41.5 1.5 36.351 1.5 30zM19 22.014A9.948 9.948 0 0 0 13 20C7.479 20 3 24.479 3 30s4.479 10 10 10c3.276 0 6.176-1.584 8-4.02V33h-2V22.014z"></path></g></svg>',

                        },
                        {
                            id: 2,
                            name: 'Оценка',
                            text: 'Быстро оценим недвижимость, бизнес и автотранспорт. Имеем аккредитацию от ведущих банков',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="27" viewBox="0 0 48 27"><g fill-rule="nonzero"><path d="M23.999 0c-3.78 0-7.328 1.046-10.461 2.546-.702.335-1.381.693-2.038 1.061-.697.396-1.367.8-2.009 1.229C6.94 6.507 4.805 8.344 3.209 9.885 1.163 11.855 0 13.5 0 13.5s1.163 1.646 3.209 3.615c1.597 1.543 3.731 3.379 6.282 5.051.643.43 1.312.834 2.009 1.229.656.371 1.336.726 2.038 1.06C16.671 25.954 20.219 27 23.999 27 37.548 27 48 13.5 48 13.5S37.548 0 23.999 0zm8.768 15.043A8.999 8.999 0 0 1 23.999 22 8.99 8.99 0 0 1 15 13.002c0-.557.05-1.096.146-1.623.76-4.191 4.437-7.38 8.852-7.38a8.997 8.997 0 0 1 7.465 3.971 8.99 8.99 0 0 1 .952 1.831 9.047 9.047 0 0 1 .352 5.242z"></path><path d="M30.547 10.156a7.893 7.893 0 0 0-.742-1.499 7.098 7.098 0 0 0-3.165-2.658c.086.429.137.863.137 1.302 0 .508-.062 1-.164 1.479-.65 2.899-3.154 5.064-6.146 5.064A6.084 6.084 0 0 1 17 12.745a7.314 7.314 0 0 0 1.236 4.11c.22.339.467.653.738.94C20.252 19.15 22.031 20 23.999 20c3.325 0 6.104-2.395 6.822-5.619A7.635 7.635 0 0 0 31 12.727c0-.897-.159-1.786-.453-2.571z"></path></g></svg>',

                        },
                        {
                            id: 3,
                            name: 'Аналитика рынка',
                            text: 'Подготовим для вас рекомендации для выгодной продажи на основании реальных данных по рынку',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><g fill="none" fill-rule="evenodd"><path class="f1" fill-rule="nonzero" d="M3 0h2v48H3z"></path><path class="f1" fill-rule="nonzero" d="M0 43h48v2H0zM12 27h8v15h-8zM21 33h8v9h-8zM30 39h8v3h-8zM39 42V31h8v11"></path><path class="f2" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"d="M4 43s5-28 14-26c5.857 1.302 5.512 17.992 13 13 3-2 7-26 16-26"></path><path class="f1" fill-rule="nonzero" d="M4 3h29v2H4zM5 7h12v2H5zM5 11h21v2H5z"></path></g></svg>',

                        },
                        {
                            id: 4,
                            name: 'Юридические услуги',
                            text: 'Сопроводим сделку купли-продажи, обеспечим законность и защитим ваши интересы в суде',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><path fill-rule="nonzero"d="M33.108 18.083a4.874 4.874 0 0 0 6.618.255l1.154-.99L30.653 7.119l-.99 1.157a4.875 4.875 0 0 0 .253 6.616l3.192 3.191zM48 11.702L36.3 0l-4.411 5.476 10.637 10.636L48 11.702zM6.006 44.281l.068-.025c9.704-5.742 21.068-7.438 21.068-7.438-1.849-6.663 5.358-15.086 5.358-15.086l-2.584-2.584-3.646-3.649s-8.425 7.212-15.083 5.361c0 0-1.701 11.366-7.44 21.069l-.021.074A1.996 1.996 0 0 0 2 41a2 2 0 1 0 2 2c0-.019-.005-.036-.005-.055l9.698-9.698a4 4 0 1 1 1.063 1.064l-9.694 9.695C5.041 44.006 5.021 44 5 44a2 2 0 1 0 2 2 1.99 1.99 0 0 0-.994-1.719zM8 48h40v-2H8v2z"></path></svg>',

                        },
                        {
                            id: 5,
                            name: 'Продвижение объекта',
                            text: 'Разработаем план активного продвижения и обеспечим премиальное размещение объекта на 48-ми рекламных площадках',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><g fill="none" fill-rule="evenodd"><path class="f1" fill-rule="nonzero" d="M39.786 2.938c.002-.021.038-.021.04 0 .24 3.979 2.615 7.874 5.824 9.14.316.124.439.515.118.631-3.123 1.128-5.482 4.617-5.897 8.425-.006.057-.115.152-.119.096-.384-3.812-2.719-7.323-5.828-8.49-.328-.124-.287-.533.04-.661 3.207-1.266 5.582-5.161 5.822-9.141zM26.525 11.602c.002-.025.039-.025.041 0 .172 2.256 1.405 4.446 3.089 5.31.283.145.221.547-.063.693-1.532.794-2.681 2.638-2.974 4.67-.012.08-.142.026-.154-.054-.313-2.065-1.509-3.928-3.09-4.678-.265-.126-.199-.499.063-.632 1.683-.863 2.917-3.054 3.088-5.309z"></path><path class="f2" stroke-linecap="round" stroke-linejoin="round"  d="M26.525 11.602c.002-.025.039-.025.041 0 .172 2.256 1.405 4.446 3.089 5.31.283.145.221.547-.063.693-1.532.794-2.681 2.638-2.974 4.67-.012.08-.142.026-.154-.054-.313-2.065-1.509-3.928-3.09-4.678-.265-.126-.199-.499.063-.632 1.683-.863 2.917-3.054 3.088-5.309z"></path><path class="f1" fill-rule="nonzero" d="M12.713 9.413l-1.444-1.439L19.271 0l1.449 1.435zM45.109 28.96l1.446 1.44L48 28.96l-1.445-1.439zM39.396 37.533l-1.444-1.44 5.713-5.693 1.444 1.44zM8.334 10.898l-6.069 6.047c-1.855 1.831-1.683 4.964.383 7.003l21.42 21.346c2.065 2.043 5.366 2.146 7.22.317l5.94-5.918L8.334 10.898zm-2.167 5.04l1.445-1.44 26.005 25.914-1.445 1.44L6.167 15.938zM14.325 38.042l-9.394 9.362a2.042 2.042 0 0 1-2.883 0L.596 45.957a2.029 2.029 0 0 1 0-2.873l9.394-9.36"></path></g></svg>',

                        },
                        {
                            id: 6,
                            name: 'Профессиональная фотосъемка',
                            text: 'Организуем профессиональную фотосъемку, что сделает ваш объект более привлекательным и ускорит его продажу',
                            icon: '<svg xmlns="http://www.w3.org/2000/svg" width="48" height="45" viewBox="0 0 48 45"><g fill-rule="nonzero"><path d="M29.5 22.5a9 9 0 1 0 .001 18.001A9 9 0 0 0 29.5 22.5zM26 31c-1.656 0-3-1.345-3-3s1.344-3 3-3 3 1.345 3 3-1.344 3-3 3zM38 11a2 2 0 0 1 2-2h3c1.104 0 2 2 2 2h-7zM4 11l.891-1.336A3.745 3.745 0 0 1 8 8h2c1.246 0 2.418.627 3.109 1.664L14 11H4z"></path><path d="M44 12H4a4 4 0 0 0-4 4v25a4 4 0 0 0 4 4h40a4 4 0 0 0 4-4V16a4 4 0 0 0-4-4zm-9 4a1 1 0 0 1 1-1h7a1 1 0 0 1 1 1v3a1 1 0 0 1-1 1h-7a1 1 0 0 1-1-1v-3zm-15.5-1a2.5 2.5 0 1 1 0 5 2.5 2.5 0 0 1 0-5zM46 24h-9.158A10.464 10.464 0 0 1 40 31.5C40 37.299 35.299 42 29.5 42S19 37.299 19 31.5c0-2.939 1.211-5.594 3.158-7.5H2v-2h23.05a10.44 10.44 0 0 1 4.45-1c1.593 0 3.098.365 4.45 1H46v2zM28 0h2v8h-2zM36.3 4.5l1.2 1.2L34.2 9 33 7.8zM24 7.8L22.8 9l-3.3-3.3 1.2-1.2z"></path></g></svg>',

                        },
                    ],
               }
            ],
        }
    }, 
    methods: {
        changeTabService: function(index) {
            this.tabActive = index
        }
    },
     mounted() {
        if($(window).width() < 992) {
            this.isMob = true;
        } 
    },
    computed: {
      swiper() {
        return this.$refs.mySwiper.$swiper
      }
    },
}
</script>
<template lang="pug">
    container(extraClass="section_grey section_padding")
        .service-agency
            .row
                .col
                    .service-agency--title.title_m
                        h2 {{ title || 'Купить дом просто'}}
            .row
                .col
                    template(v-if="tabsService")
                        .consultation-tab
                            ul.consultation-tab--list
                                template(v-for="(item, index) in tabsService")
                                    li.consultation-tab--name(@click="changeTabService(index)" :class="index === tabActive ? 'active' : '' ") {{ item }}
           
 
                template(v-for="(item, index) in tabsServiceMain")
                    .row.row-cols-3.m-0.gy-4.service-swiper(:data-tab-service="index" :class="index === tabActive ? 'active' : '' " v-if="index === tabActive" :serviceId="index")
                        template(v-if="isMob") 
                            swiper(:options="sliderOptions" )
                                swiper-slide.slider-fast-item(v-for="info in item.serviceTab"  :key="info.id") 
                                    div(class="col-12 col-sm-12 col-xl-4" )
                                        .service-agency--card
                                            .service-agency--icon(v-html="info.icon")
                                            .service-agency--name
                                                span {{info.name}}
                                            .service-agency--text
                                                span {{info.text}}
                                            .service-agency--btn
                                                a( :href="info.link") Подробнее
                            .swiper-pagination.swiper-pag-mob#paginationAgency
                        template(v-else) 
                            .col-12(v-for="info in item.serviceTab" class="col-sm-12 col-xl-4" )
                                .service-agency--card
                                    .service-agency--icon(v-html="info.icon")
                                    .service-agency--name
                                        span {{info.name}}
                                    .service-agency--text
                                        span {{info.text}}
                                    .service-agency--btn
                                        a( :href="info.link") Подробнее

</template>


